{
    "race": {
        "title": "Corrida de Nova Vitória",
        "subtitle": "A pista é a lei. O piloto é a bala.",
        "rivals": [
            {
                "id": "rival_01",
                "name": "Ferro Bruto",
                "portrait": "rival_01.png",
                "style": "aggressive",
                "specialAbility": "Ramming Speed — força colisão lateral causando +15 de dano ao alvo",
                "color": "#dc2626"
            },
            {
                "id": "rival_02",
                "name": "Sílvia Chrome",
                "portrait": "rival_02.png",
                "style": "technical",
                "specialAbility": "Overclock — analisa o caminho futuro, recebe +2 em próximo dado",
                "color": "#2563eb"
            },
            {
                "id": "rival_03",
                "name": "Zé Louco",
                "portrait": "rival_03.png",
                "style": "unpredictable",
                "specialAbility": "Caos Puro — resultado do dado aleatório (±3), ninguém sabe o que vai fazer",
                "color": "#7c3aed"
            },
            {
                "id": "rival_04",
                "name": "A Sombra",
                "portrait": "rival_04.png",
                "style": "saboteur",
                "specialAbility": "Sabotagem Silenciosa — quando adjacente, chance de travar o acelerador adversário",
                "color": "#374151"
            },
            {
                "id": "rival_05",
                "name": "Camila Fogo",
                "portrait": "rival_05.png",
                "style": "aggressive",
                "specialAbility": "Nitro Duplo — usa dois nitrôs em série quando está em 4º lugar ou abaixo",
                "color": "#ea580c"
            },
            {
                "id": "rival_06",
                "name": "Titânio Rex",
                "portrait": "rival_06.png",
                "style": "technical",
                "specialAbility": "Armadura Pesada — recebe apenas metade do dano de colisões",
                "color": "#52525b"
            },
            {
                "id": "rival_07",
                "name": "Ghost.exe",
                "portrait": "rival_07.png",
                "style": "saboteur",
                "specialAbility": "Jack Remoto — hackeia o veículo alvo, causando instabilidade por 1 segmento",
                "color": "#065f46"
            }
        ],
        "segments": [
            {
                "id": 1,
                "name": "LARGADA",
                "location": "Zona Industrial Sul",
                "description": "A multidão urra. O semáforo holográfico pulsa em vermelho. Quando virar verde, tudo muda.",
                "paths": [
                    {
                        "id": "A",
                        "name": "Corredor Principal",
                        "difficulty": "medium",
                        "difficultyThreshold": 5,
                        "pathModifier": 0,
                        "image": "seg1_pathA.png",
                        "icon": "Road",
                        "narrative": "Você pressiona o acelerador junto com sete outros motores rugindo. O corredor industrial se abre à frente como uma boca de concreto. Rivais flanqueiam você de todos os lados. O caminho é rápido, mas vai exigir que você abra espaço na marra.",
                        "outcomes": {
                            "critical_failure": {
                                "narrative": "A pressão dos dois lados ao mesmo tempo é demais. Seu veículo é espremido, amassado, cuspido para o lado. O corredor cospe você em pedaços de lataria e posição. _{Se rivais passaram: Enquanto você recupera o controle, {rivais_que_passaram} abrem vantagem que vai doer por muito tempo.}_"
                            },
                            "failure": {
                                "narrative": "Você sustenta, mas com custo. O contato lateral foi duro demais e seu ritmo cai por alguns segundos decisivos. _{Se rivais passaram: Tempo suficiente para {rivais_que_passaram} deslizarem pela abertura que você deixou.}_"
                            },
                            "success": {
                                "narrative": "Você encontra um bolsão de ar entre dois rivais e joga o veículo por ele sem hesitar. A multidão nas sacadas das fábricas explode em gritos. Você sai do corredor com a lataria intacta e o ritmo no lugar certo."
                            },
                            "critical_success": {
                                "narrative": "Puro instinto. Você lê o corredor como um código e escolhe a linha exata antes que os rivais sequer percebam o que você fez. _{Se ultrapassou alguém: {rivais_ultrapassados} ficam para trás sem entender o que aconteceu.}_ A multidão vai falar disso depois da corrida."
                            }
                        }
                    },
                    {
                        "id": "B",
                        "name": "Galpão Abandonado",
                        "difficulty": "high",
                        "difficultyThreshold": 7,
                        "pathModifier": 1,
                        "image": "seg1_pathB.png",
                        "icon": "Warehouse",
                        "narrative": "Uma abertura no muro de concreto — entrada do galpão velho. Piso quebrado, vigas caídas, escuridão quase total. Nenhum rival se atreve. Se você conseguir atravessar esse inferno, vai emergir bem à frente.",
                        "outcomes": {
                            "critical_failure": {
                                "narrative": "Uma viga cai no momento errado, no lugar errado. O impacto te joga contra a parede de tijolos com um barulho que ecoa no galpão inteiro. Você sai chacoalhando, desorientado, bem atrás de onde entrou. _{Se rivais passaram: {rivais_que_passaram} já estão longe quando você finalmente vê a luz do outro lado.}_"
                            },
                            "failure": {
                                "narrative": "Você atravessa, mas o piso trai você duas vezes. A suspensão absorve o que pode. Você sai mais lento do que precisava — e perdeu a vantagem que esse atalho deveria dar."
                            },
                            "success": {
                                "narrative": "Você dança entre as vigas com atenção e precisão. O galpão cospe você do outro lado antes dos rivais que foram pelo corredor principal. Silêncio, depois velocidade."
                            },
                            "critical_success": {
                                "narrative": "Isso não tem explicação racional. Você atravessou aquela escuridão como se tivesse memorizado cada centímetro do lugar. _{Se ultrapassou alguém: Você emerge {n_posicoes_ganhas} posições acima do que entrou — {rivais_ultrapassados} nem entenderam de onde você veio.}_ Vai ser difícil repetir algo assim."
                            }
                        }
                    },
                    {
                        "id": "C",
                        "name": "Marginal do Canal",
                        "difficulty": "low",
                        "difficultyThreshold": 3,
                        "pathModifier": -1,
                        "image": "seg1_pathC.png",
                        "icon": "Waves",
                        "narrative": "A marginal fede a esgoto e produto químico, mas está vazia de rivais. O caminho é mais longo, mas você vai sozinho. O canal reflete as luzes de neon da cidade enquanto você corta pelo asfalto úmido.",
                        "outcomes": {
                            "critical_failure": {
                                "narrative": "O canal transbordou. Há lama no asfalto e você só descobre quando as rodas perdem qualquer contato com a realidade. Você bate numa barreira de metal enferrujada com um estrondo que assusta até os ratos. _{Se rivais passaram: {rivais_que_passaram} escolheram melhor — e o placar mostra.}_"
                            },
                            "failure": {
                                "narrative": "O piso molhado te pregou uma peça no momento mais inconveniente. Um deslizamento curto, mas suficiente. Você retorna ao pelotão com o ânimo abalado e a posição piorada."
                            },
                            "success": {
                                "narrative": "Você navega pela marginal sem incidentes. Seguro, limpo, sem contato. O neon se reflete na água enquanto você corre sozinho. Você re-entra na rota principal exatamente onde saiu."
                            },
                            "critical_success": {
                                "narrative": "A marginal estava no seu dia. Asfalto úmido, tração perfeita, zero rival. Você cruza o trecho mais rápido do que qualquer rota deveria permitir. _{Se ultrapassou alguém: {rivais_ultrapassados} escolheram o caminho mais badalado — você escolheu o caminho certo.}_"
                            }
                        }
                    }
                ]
            },
            {
                "id": 2,
                "name": "SUBIDA DO VIADUTO",
                "location": "Viaduto Getúlio",
                "description": "O Viaduto Getúlio. Trinta metros de concreto e aço oxidado sobre a cidade. Lá em cima, não tem para onde correr.",
                "paths": [
                    {
                        "id": "A",
                        "name": "Pista Principal",
                        "difficulty": "medium",
                        "difficultyThreshold": 5,
                        "pathModifier": 0,
                        "image": "seg2_pathA.png",
                        "icon": "ArrowUp",
                        "narrative": "A rampa principal do viaduto. Exposição total — você vê cada rival, e cada rival vê você. A multidão lá embaixo parece formiguinhas. Aqui se decide quem tem coragem de apertar mais.",
                        "outcomes": {
                            "critical_failure": {
                                "narrative": "Você freou tarde na descida. O veículo patina, você perde a linha, e a janela que os rivais precisavam se abre na sua frente como uma porta de convidado. _{Se rivais passaram: {rivais_que_passaram} passam enquanto você ainda está tentando encontrar o controle.}_ A cidade lá embaixo não tem piedade."
                            },
                            "failure": {
                                "narrative": "A subida foi bem. A descida, não. Você saiu da curva fechado demais e perdeu o ritmo que tinha construído. Sem acidente, mas sem avanço."
                            },
                            "success": {
                                "narrative": "Você abre o acelerador na subida e pressiona onde os rivais hesitaram. No topo do viaduto, sua posição está melhor do que quando você chegou na rampa."
                            },
                            "critical_success": {
                                "narrative": "Você usou a inclinação do viaduto como catapulta. Acelerou quando todo mundo freou, freou quando todo mundo esperava que você acelerasse. Leitura cirúrgica da pista. _{Se ultrapassou alguém: {rivais_ultrapassados} ficam para trás na rampa — e você nem olha no espelho.}_"
                            }
                        }
                    },
                    {
                        "id": "B",
                        "name": "Rampa de Serviço",
                        "difficulty": "high",
                        "difficultyThreshold": 6,
                        "pathModifier": 1,
                        "image": "seg2_pathB.png",
                        "icon": "EyeOff",
                        "narrative": "Embaixo do viaduto, pelo corredor de serviço. Pilares de concreto, grafite antigo, quase nenhuma visibilidade. Mas quem conhece o traçado pode emergir antes dos rivais que foram pelo topo.",
                        "outcomes": {
                            "critical_failure": {
                                "narrative": "Você não viu o pilar parcialmente destruído até ser tarde demais. O impacto ecoa como um trovão lá embaixo. Você sai mancando de velocidade e de posição. _{Se rivais passaram: {rivais_que_passaram} aparecem na saída do viaduto bem antes de você.}_"
                            },
                            "failure": {
                                "narrative": "Um pilar te pegou de raspão na escuridão. Espelho retrovisor ficou para trás, preso no concreto. Você sai ileso mas lento — a vantagem do atalho evaporou."
                            },
                            "success": {
                                "narrative": "Você decora os pilares e passa entre eles como se tivesse feito isso cem vezes. Você emerge na saída do viaduto à frente de quem foi pelo topo. Silencioso, eficiente."
                            },
                            "critical_success": {
                                "narrative": "Perfeito no escuro. Você navegou aquele corredor como se tivesse sensores no lugar de olhos. _{Se ultrapassou alguém: Você reaparece na pista {n_posicoes_ganhas} posição(ões) acima — {rivais_ultrapassados} nem perceberam por onde você passou.}_ Isso é o que separa piloto de lenda."
                            }
                        }
                    },
                    {
                        "id": "C",
                        "name": "Rua Lateral",
                        "difficulty": "low",
                        "difficultyThreshold": 3,
                        "pathModifier": -1,
                        "image": "seg2_pathC.png",
                        "icon": "Store",
                        "narrative": "A rua lateral passa por uma feira livre — barracas de comida, fios de luz cruzando de janela em janela, cheiro de churrasco e óleo. Mais longa, mas cheia de personagem. E de gente no meio do caminho.",
                        "outcomes": {
                            "critical_failure": {
                                "narrative": "O trânsito de pedestres era mais denso do que parecia. Você fica preso por segundos agoniantes — buzinando, focinhando, sem saída. _{Se rivais passaram: {rivais_que_passaram} já estão longe quando o corredor finalmente se abre.}_ Tudo isso por causa de uma feira de bairro."
                            },
                            "failure": {
                                "narrative": "Uma barraca de frutas entrou no seu caminho. Laranjas em todos os lugares. Você perde ritmo — e posição. A culpa é de ninguém e é de todo mundo."
                            },
                            "success": {
                                "narrative": "Você buzina e as pessoas se jogam para os lados com uma sincronia quase cômica. Um vendedor te joga uma espetada de graça enquanto você passa. Você retorna à rota principal sem perder posição."
                            },
                            "critical_success": {
                                "narrative": "Você transformou uma rua de feira em pista de corrida e ninguém se machucou. Os moradores da lateral vão contar essa história por semanas. _{Se ultrapassou alguém: {rivais_ultrapassados} escolheram o viaduto — você escolheu o bairro. Seu placar, sua escolha.}_"
                            }
                        }
                    }
                ]
            },
            {
                "id": 3,
                "name": "ZONA COMERCIAL",
                "location": "Camelódromo da Vitória",
                "description": "O coração do comércio informal de Nova Vitória. Dez mil pessoas que não queriam estar no seu caminho. Agora estão.",
                "paths": [
                    {
                        "id": "A",
                        "name": "Meio da Feira",
                        "difficulty": "high",
                        "difficultyThreshold": 7,
                        "pathModifier": 1,
                        "image": "seg3_pathA.png",
                        "icon": "ShoppingBag",
                        "narrative": "Você corta direto pelo meio do Camelódromo. Barracas passam como relâmpagos. Pedestres gritam. Vendedores se jogam pro lado. É caótico, é perigoso — e é o caminho mais curto.",
                        "outcomes": {
                            "critical_failure": {
                                "narrative": "Uma multidão fecha o corredor antes que você possa frear. Você para, recua, tenta outra rota. Quando finalmente sai da feira, a corrida seguiu sem você. _{Se rivais passaram: {rivais_que_passaram} já estão longe — eles escolheram melhor ou tiveram mais sorte. Hoje, tanto faz.}_"
                            },
                            "failure": {
                                "narrative": "Uma barraca de eletrônicos piratas te pega de lado. Você passa por cima de uma caixa de mercadoria falsificada com um estrondo indigno. A lataria sofreu. A posição, também."
                            },
                            "success": {
                                "narrative": "Você navega pelo caos com atenção cirúrgica. A multidão para de gritar xingamentos e começa a gritar seu nome. Você emerge do Camelódromo mais à frente do que entrou."
                            },
                            "critical_success": {
                                "narrative": "Impossível de explicar. Você foi pelo meio da feira a velocidade absurda e saiu do outro lado sem arranhar uma barraca sequer. _{Se ultrapassou alguém: {rivais_ultrapassados} ficam para trás — você ganhou {n_posicoes_ganhas} posição(ões) no meio do caos mais denso da cidade.}_ A Vitória vai falar disso."
                            }
                        }
                    },
                    {
                        "id": "B",
                        "name": "Avenida Beira-Mar",
                        "difficulty": "medium",
                        "difficultyThreshold": 5,
                        "pathModifier": 0,
                        "image": "seg3_pathB.png",
                        "icon": "Eye",
                        "narrative": "Aberta, iluminada por hologramas de propaganda e o reflexo do oceano poluído. É a rota mais limpa — mas há uma viatura estacionada lá no final, e eles parecem que viram você.",
                        "outcomes": {
                            "critical_failure": {
                                "narrative": "A viatura sai do estacionamento e bloqueia sua linha com precisão irritante. Você faz uma sequência de manobras desesperadas que custam tempo e lataria. _{Se rivais passaram: {rivais_que_passaram} passam enquanto você está dançando com a lei.}_"
                            },
                            "failure": {
                                "narrative": "A viatura cruza na sua frente por dois segundos que envelhecem sua alma. Você desvia e segue, mas a interrupção foi suficiente para custar posição."
                            },
                            "success": {
                                "narrative": "A sirene começa a ligar, mas você já passou. Você é uma mancha no horizonte quando eles ainda estão tentando ligar o motor. Beira-mar limpa, posição mantida."
                            },
                            "critical_success": {
                                "narrative": "Você passou tão rápido que a viatura nem chegou a registrar a placa. O reflexo do neon no oceano fica no seu retrovisor como uma pintura. _{Se ultrapassou alguém: {rivais_ultrapassados} escolheram rotas mais lentas — você escolheu a reta vazia. Placar certo.}_"
                            }
                        }
                    },
                    {
                        "id": "C",
                        "name": "Estacionamento do Shopping",
                        "difficulty": "medium",
                        "difficultyThreshold": 5,
                        "pathModifier": 0,
                        "image": "seg3_pathC.png",
                        "icon": "Lock",
                        "narrative": "Terreno privado do ShopVitória. Segurança armada, câmeras de IA, piso polido. Mas as rampas internas cortam caminho. Se você entrar rápido e sair mais rápido, funciona.",
                        "outcomes": {
                            "critical_failure": {
                                "narrative": "O sistema de IA do shopping fecha as cancelas automáticas em sequência antes que você consiga reagir. Você bate numa delas com um barulho que faz todo cliente do térreo olhar para cima. _{Se rivais passaram: {rivais_que_passaram} estão do lado de fora rindo — ou pelo menos é assim que parece.}_"
                            },
                            "failure": {
                                "narrative": "Um segurança lança um bloqueio de grade metálica no seu caminho. Você passa por cima. A suspensão absorve, mas doi. Você sai atrás de onde deveria."
                            },
                            "success": {
                                "narrative": "Você usa as rampas de estacionamento como se fossem uma pista particular. Os seguranças ficam gritando no rádio enquanto você some pelo lado oposto, rindo."
                            },
                            "critical_success": {
                                "narrative": "Você entrou, subiu, desceu e saiu antes que o sistema de câmeras conseguisse travar qualquer porta. _{Se ultrapassou alguém: {rivais_ultrapassados} estavam na Beira-Mar ou na feira — você estava três andares acima deles.}_ Eficiente e invisível."
                            }
                        }
                    }
                ]
            },
            {
                "id": 4,
                "name": "FAVELA DA ENCOSTA",
                "location": "Complexo do Morro Vermelho",
                "description": "O Morro Vermelho. Onde a lei da cidade termina e a lei da gang começa. Aqui cada metro é negociação.",
                "paths": [
                    {
                        "id": "A",
                        "name": "Viela Principal",
                        "difficulty": "high",
                        "difficultyThreshold": 6,
                        "pathModifier": 1,
                        "image": "seg4_pathA.png",
                        "icon": "Skull",
                        "narrative": "A viela principal do Morro é controlada. Eles cobram pedágio. Você pode pagar, pode negociar — ou pode tentar passar na força. Em qualquer caso, eles vão se lembrar do seu rosto.",
                        "outcomes": {
                            "critical_failure": {
                                "narrative": "A viela fecha com um carro velho atravessado no caminho. Você tenta o meio-fio e acaba engaletado entre muro e ferragem. _{Se rivais passaram: {rivais_que_passaram} já sumiram morro acima quando você finalmente escapa.}_ Custou posição, lataria e orgulho."
                            },
                            "failure": {
                                "narrative": "Você para, negocia no grito, e paga um preço que dói mais do que deveria. Tempo perdido, posição perdida. A gang aceita o pagamento sem agradecer."
                            },
                            "success": {
                                "narrative": "Você passa tão rápido que ninguém tem tempo de reagir direito. Uma garrafa bate na sua lataria — mas você já está três quarteirões à frente quando o vidro termina de cair."
                            },
                            "critical_success": {
                                "narrative": "Velocidade e leitura perfeita do ambiente. Você entrou, leu quem estava onde, escolheu a linha e saiu antes que a viela soubesse que você estava lá. _{Se ultrapassou alguém: {rivais_ultrapassados} estão mais abaixo no morro — você já está na saída.}_ Respeito conquistado na prática."
                            }
                        }
                    },
                    {
                        "id": "B",
                        "name": "Telhados das Casas",
                        "difficulty": "high",
                        "difficultyThreshold": 8,
                        "pathModifier": 2,
                        "image": "seg4_pathB.png",
                        "icon": "Home",
                        "narrative": "Existe uma rota — quase lenda — pelos telhados de laje das casas do Morro. Estreita, sem grade, com queda de dez metros de qualquer lado. Se o veículo aguentar, você voa sobre tudo.",
                        "outcomes": {
                            "critical_failure": {
                                "narrative": "O telhado cede no primeiro metro. Você desce três metros e cai num quintal cheio de varais. Você sai de lá de marcha ré, enrolado em roupa de cama, sem dignidade e sem posição. _{Se rivais passaram: {rivais_que_passaram} nem sabem o que você tentou — e talvez seja melhor assim.}_"
                            },
                            "failure": {
                                "narrative": "Você passa metade do percurso pelos telhados antes de uma laje ceder. Você cai meio metro e aterra num beco. Suspensão chorando, posição piorada."
                            },
                            "success": {
                                "narrative": "Um momento de insanidade pura. Você atravessa quarteirões de telhado a velocidade proibida. Crianças do Morro gritam e filmam. Você vai ser lenda aqui."
                            },
                            "critical_success": {
                                "narrative": "Três quarteirões de laje. Sem pausa, sem hesitação, sem queda. _{Se ultrapassou alguém: Você aterra na saída do morro {n_posicoes_ganhas} posição(ões) acima — {rivais_ultrapassados} ainda estão nas vielas lá embaixo.}_ Crianças do Morro gritam e filmam. Você vai ser lenda aqui."
                            }
                        }
                    },
                    {
                        "id": "C",
                        "name": "Estrada de Terra",
                        "difficulty": "low",
                        "difficultyThreshold": 3,
                        "pathModifier": -1,
                        "image": "seg4_pathC.png",
                        "icon": "TreePine",
                        "narrative": "O sopé do morro tem uma estrada de terra esquecida pelos mapas. Nenhuma gang, nenhum rival. Só poeira, mato e silêncio. É o caminho mais longo, mas ninguém vai te incomodar.",
                        "outcomes": {
                            "critical_failure": {
                                "narrative": "A terra molhada engole as rodas. Você fica preso por minutos angustiantes até conseguir sair. O Morro inteiro parece estar rindo. _{Se rivais passaram: {rivais_que_passaram} já terminaram o segmento enquanto você ainda estava discutindo com a lama.}_"
                            },
                            "failure": {
                                "narrative": "A estrada é mais comprida do que parecia no mapa — e mais traiçoeira. Você perde posição por tempo, não por dano. Ninguém te tocou, mas o relógio te cobrou."
                            },
                            "success": {
                                "narrative": "Você sai da estrada de terra na saída do Morro praticamente intocado. Poeira na lataria, nada mais. Posição mantida — que às vezes é o suficiente."
                            },
                            "critical_success": {
                                "narrative": "Caminho mais longo, mas você voou. A estrada esquecida tratou seu veículo melhor do que qualquer pista asfaltada. _{Se ultrapassou alguém: {rivais_ultrapassados} escolheram as vielas — você escolheu o silêncio. Escolha certa.}_"
                            }
                        }
                    }
                ]
            },
            {
                "id": 5,
                "name": "ZONA PORTUÁRIA",
                "location": "Porto Novo",
                "description": "O Porto Novo cheira a óleo, sal e dinheiro sujo. Containers de dez metros de cada lado. É um labirinto feito de metal.",
                "paths": [
                    {
                        "id": "A",
                        "name": "Labirinto de Contêineres",
                        "difficulty": "high",
                        "difficultyThreshold": 6,
                        "pathModifier": 1,
                        "image": "seg5_pathA.png",
                        "icon": "Box",
                        "narrative": "Contêineres empilhados formam corredores de metal enferrujado. Aqui é fácil fechar um corredor, fácil se perder. Mas quem conhece o traçado pode encurtar muito o caminho.",
                        "outcomes": {
                            "critical_failure": {
                                "narrative": "Você entra no corredor errado. Um beco sem saída. Você tem que dar marcha ré por duzentos metros enquanto rivals passam pela rota correta. Humilhante e silencioso. _{Se rivais passaram: {rivais_que_passaram} já estão do outro lado do porto.}_"
                            },
                            "failure": {
                                "narrative": "Um bloqueio te esperava numa dobra. Você escapa, mas arranha o lado inteiro do veículo numa sequência de contêineres. Som horrível, dano real, posição perdida."
                            },
                            "success": {
                                "narrative": "Você memoriza os corredores como um código. O labirinto se abre para você. Você emerge pelo outro lado antes que qualquer rival tenha processado qual bifurcação tomar."
                            },
                            "critical_success": {
                                "narrative": "Você leu o labirinto de metal como se fosse um mapa na sua cabeça. Zero hesitação, zero erro. _{Se ultrapassou alguém: {rivais_ultrapassados} ainda estão girando em círculo quando você já saiu pela outra ponta.}_ O Porto Novo foi seu hoje."
                            }
                        }
                    },
                    {
                        "id": "B",
                        "name": "Doca Molhada",
                        "difficulty": "medium",
                        "difficultyThreshold": 5,
                        "pathModifier": 0,
                        "image": "seg5_pathB.png",
                        "icon": "Droplets",
                        "narrative": "Linha reta — mas o piso está encharcado de óleo e água salgada. O reflexo do neon na água seria bonito, se você não soubesse que derrapar aqui significaria um banho forçado no porto.",
                        "outcomes": {
                            "critical_failure": {
                                "narrative": "O óleo no piso não perdoa. Você derrapa completamente e bate numa defensiva de aço com um estrondo que o porto inteiro ouve. _{Se rivais passaram: {rivais_que_passaram} passam rindo — ou pelo menos parece que estão.}_ O porto não tem piedade."
                            },
                            "failure": {
                                "narrative": "Meio derrapagem, meio descontrole. Você patina por três metros antes de recuperar. Ninguém cai na água hoje, mas a posição foi embora."
                            },
                            "success": {
                                "narrative": "Você mantém as rodas sob controle no piso escorregadio e chega ao fim da doca sem drama. A linha reta te dá vantagem sobre quem escolheu o labirinto."
                            },
                            "critical_success": {
                                "narrative": "Você domou a doca oleosa como se tivesse rodado nela a vida inteira. Velocidade máxima, controle total. _{Se ultrapassou alguém: {rivais_ultrapassados} escolheram o labirinto — você escolheu a reta. Escolha mais rápida.}_"
                            }
                        }
                    },
                    {
                        "id": "C",
                        "name": "Armazém Frigorífico",
                        "difficulty": "low",
                        "difficultyThreshold": 3,
                        "pathModifier": -1,
                        "image": "seg5_pathC.png",
                        "icon": "Snowflake",
                        "narrative": "O armazém frigorífico do Porto — quase zero grau, névoa branca, piso em gelo seco. Nenhum rival quer entrar aqui. Você vai sozinho, mas o frio deixa o motor instável.",
                        "outcomes": {
                            "critical_failure": {
                                "narrative": "O motor congela parcialmente. Você fica parado por tempo demais tentando dar partida no frio que parece pessoal. _{Se rivais passaram: Quando o motor finalmente responde, {rivais_que_passaram} já terminaram o segmento.}_ O frio não liga para a sua pressa."
                            },
                            "failure": {
                                "narrative": "O motor treme no frio extremo e perde potência em segundos decisivos. Você sai do armazém mais devagar do que entrou — e mais atrás."
                            },
                            "success": {
                                "narrative": "O frio é intenso mas o caminho é limpo. Você sai do outro lado do armazém sem um rival perto. A névoa fica no seu rastro como efeito cinematográfico involuntário."
                            },
                            "critical_success": {
                                "narrative": "O motor não reclamou, o piso não traiu, o frio não intimidou. Você atravessou o armazém como se tivesse turbina no lugar de câmbio. _{Se ultrapassou alguém: {rivais_ultrapassados} evitaram o frigorífico — e pagaram o preço por isso.}_"
                            }
                        }
                    }
                ]
            },
            {
                "id": 6,
                "name": "RETA FINAL",
                "location": "Avenida da Independência",
                "description": "Esta é a Avenida da Independência. Dois quilômetros de asfalto entre você e a glória. Ou a derrota eterna.",
                "paths": [
                    {
                        "id": "A",
                        "name": "Reta Central",
                        "difficulty": "medium",
                        "difficultyThreshold": 5,
                        "pathModifier": 0,
                        "image": "seg6_pathA.png",
                        "icon": "Zap",
                        "narrative": "A reta aberta. Todos os rivais visíveis. Nenhum lugar para esconder. É aqui, na reta, onde motores decidem quem vence.",
                        "outcomes": {
                            "critical_failure": {
                                "narrative": "Alguma coisa falhou quando não podia falhar. Seu veículo treme, perde resposta, hesita por segundos que parecem décadas. _{Se rivais passaram: {rivais_que_passaram} passam por você como se você estivesse parado — porque você estava quase parado.}_ Dois segundos são uma eternidade na Reta Final."
                            },
                            "failure": {
                                "narrative": "Você não conseguiu abrir o acelerador no momento certo. A janela fechou e você ficou preso atrás de quem deveria ter ficado atrás de você. _{Se rivais passaram: {rivais_que_passaram} aproveitaram sua hesitação.}_"
                            },
                            "success": {
                                "narrative": "Você abre o acelerador e não fecha mais. O motor responde como se soubesse que é a última chance. Você termina o segmento melhor posicionado do que entrou."
                            },
                            "critical_success": {
                                "narrative": "Você encontrou algo a mais na reta — um segundo dentro de si mesmo que os rivais não têm. _{Se ultrapassou alguém: {rivais_ultrapassados} não tiveram resposta — você passou {n_posicoes_ganhas} veículo(s) em linha reta pura.}_ É aqui que corridas são decididas."
                            }
                        }
                    },
                    {
                        "id": "B",
                        "name": "Pela Calçada",
                        "difficulty": "high",
                        "difficultyThreshold": 7,
                        "pathModifier": 2,
                        "image": "seg6_pathB.png",
                        "icon": "PersonStanding",
                        "narrative": "Ilegal, perigoso, glorioso. A calçada da Av. Independência está cheia de pedestres, mas é mais larga que parece. Se você tiver coragem — e habilidade — vai ultrapassar todos pela direita.",
                        "outcomes": {
                            "critical_failure": {
                                "narrative": "Alguém surgiu do nada no momento pior possível. Você freia, quase capota, perde o ritmo e a posição de uma vez. _{Se rivais passaram: {rivais_que_passaram} passam pela esquerda enquanto você ainda está tentando não matar ninguém.}_ Vai ter muito o que explicar depois."
                            },
                            "failure": {
                                "narrative": "Você consegue a calçada, mas bate num poste de propaganda holográfica que não estava no ângulo certo. O veículo sai balançando. Posição perdida, orgulho arranhado."
                            },
                            "success": {
                                "narrative": "Você foi pela calçada e as pessoas se jogaram para os lados como numa coreografia ensaiada. Você avança na corrida e ainda sai do segmento ileso."
                            },
                            "critical_success": {
                                "narrative": "Isso não tem lógica. Você foi pela calçada a velocidade que não se menciona em público e não tocou em ninguém. _{Se ultrapassou alguém: {rivais_ultrapassados} ficam para trás na pista principal enquanto você passa por fora com precisão absurda.}_ A Vitória vai guardar esse replay."
                            }
                        }
                    },
                    {
                        "id": "C",
                        "name": "Túnel Submerso",
                        "difficulty": "high",
                        "difficultyThreshold": 7,
                        "pathModifier": 2,
                        "image": "seg6_pathC.png",
                        "icon": "Moon",
                        "narrative": "Existe um túnel submerso sob a Av. Independência — construído numa era anterior, ativo mas esquecido. Completamente escuro. Apenas os faróis do seu veículo. Ninguém sabe o que tem lá dentro. Tudo ou nada.",
                        "outcomes": {
                            "critical_failure": {
                                "narrative": "O túnel estava inundado. Não completamente — só o suficiente para apagar o motor. Você sai do outro lado escorregando pelo asfalto encharcado, em silêncio forçado. _{Se rivais passaram: {rivais_que_passaram} cruzam a linha de chegada enquanto você ainda está enxugando o assoalho.}_ Tudo ou nada — e hoje foi nada."
                            },
                            "failure": {
                                "narrative": "O túnel não era completamente vazio. Você bate em equipamentos velhos no escuro, sem ver nada antes do impacto. Você emerge do outro lado, mas mais atrás do que deveria."
                            },
                            "success": {
                                "narrative": "O túnel é uma linha reta perfeita. Sem obstáculos, sem rivais, sem limite. Você sai do outro lado antes de quem foi pela reta aberta. O escuro foi seu aliado."
                            },
                            "critical_success": {
                                "narrative": "O escuro do túnel foi o melhor asfalto da corrida. Sem rival, sem interferência, sem limitação. Velocidade pura. _{Se ultrapassou alguém: Você emerge do subsolo {n_posicoes_ganhas} posição(ões) acima — {rivais_ultrapassados} ainda estão na reta quando você já cruzou.}_ O túnel esquecido vai ser lendário depois de hoje."
                            }
                        }
                    }
                ]
            }
        ],
        "specialEvents": {
            "sabotage": {
                "title": "SABOTAGEM!",
                "description": "Um rival adjacente está tentando interferir no seu veículo.",
                "options": [
                    {
                        "id": "dodge",
                        "label": "DESVIAR",
                        "icon": "ArrowLeft",
                        "modifier": 1
                    },
                    {
                        "id": "confront",
                        "label": "CONFRONTAR",
                        "icon": "Swords",
                        "modifier": 0
                    },
                    {
                        "id": "ignore",
                        "label": "IGNORAR",
                        "icon": "X",
                        "modifier": -1
                    }
                ]
            },
            "ncpd": {
                "title": "NCPD NA PISTA!",
                "description": "Uma viatura da NCPD bloqueou o caminho. Novo teste de dado necessário.",
                "image": "event_ncpd.png"
            },
            "nitro": {
                "title": "NITRO ATIVADO!",
                "description": "Boost de velocidade extremo. Modificador +3 no próximo dado.",
                "image": "event_nitro.png"
            },
            "crash": {
                "title": "ACIDENTE!",
                "description": "Um rival saiu da corrida. Posições redistribuídas.",
                "image": "event_crash.png"
            }
        }
    }
}